{
  "experience": [
    {
      "position": "Research Assistant",
      "company": "The Hong Kong Polytechnic University",
      "department": "NLP Group, PolyU",
      "period": "Dec 2022-Present",
      "description": "Situated Conversational Recommendation - Investigating techniques related to large-scale pre-trained language models and multi-modal dialogue system with the goal of increasing user engagement in our dialogue system. By leveraging multiple types of information, we aim to create a more immersive experience for the user. Supervisor: Prof. Wenjie, Li"
    },
    {
      "position": "Research Assistant",
      "company": "The Hong Kong Polytechnic University",
      "department": "NLP Group, PolyU",
      "period": "Jul 2021-Dec 2022",
      "description": "Conversational Recommender System - Investigated the problem of target-guided knowledge-aware recommendation dialogue and design a dialogue generation system to make high-quality recommendations through interactive conversations proactively and naturally. This work has been accepted by the 3rd Workshop of Knowledge-aware and Conversational Recommender Systems (KaRS 2021) and the 37th AAAI conference on Artificial Intelligence (AAAI 2023). Supervisor: Prof. Wenjie, Li"
    },
    {
      "position": "Research Assistant",
      "company": "Sun Yat-sen University",
      "department": "Collective Intelligence Systems Lab",
      "period": "Feb 2018-Jul 2020",
      "description": "Machine Reading Comprehension - Proposed a Hierarchical global-aware Information Transmission mechanism, which makes use of the interaction between local-aware information and global-aware information to improve the effectiveness of the model. Employed a Memory Flow mechanism for storing and modifying information from historical questions and answers. The experimental results on CoQA datasets showed that our model obtained competitive results compared to the existing methods. Supervisor: Prof. Rong Pan"
    },
    {
      "position": "Research Intern",
      "company": "Chinese Academy of Sciences",
      "department": "NLP Group at SIAT",
      "period": "Apr 2019-Oct 2019",
      "description": "Conversational Machine Reading Comprehension - Proposed a Hierarchical Conversation Flow Transition and Reasoning (HCFTR) model for conversational machine reading comprehension. Designed a multi-flow transition mechanism to integrate global-aware information flow transition and make dynamic reasoning. Developed a multi-level flow-context attention mechanism to fuse multiple levels of hierarchical fine-grained representations and perform advanced reasoning. Supervisor: Prof. Min Yang"
    },
    {
      "position": "Research Assistant",
      "company": "Sun Yat-sen University",
      "department": "Mobile Internet and Financial Big Data Lab",
      "period": "Jul 2016-Jul 2017",
      "description": "Service-Oriented Computing - Designed a Group Preference based API Recommendation System using the Bayesian Personalized Ranking Model. Recommended appropriate APIs for Mashup (a new type of service in internet by integrating multiple sources or functions on the network). This work was also my undergraduate thesis's topic, given the award of the SYSU Excellent Graduation Thesis and accepted by International Conference on Software Engineering (ICSE-2018) and IEEE Access-2019. Supervisor: Prof. ZiBin Zheng"
    }
  ],
  "academic_service": {
    "reviewer": [
      "ACL Rolling Review (ARR), ACM MM, ACL, EMNLP"
    ]
  },
  "teaching": [
    {
        "course": "NATURAL LANGUAGE PROCESSING (COMP5423_20242_A)",
        "role": "Teaching Assistant",
        "period": "2024/25 Semester 2"
    },
    {
        "course": "DATA STRUCTURES AND DATABASE SYSTEMS (COMP5112_20241_B)",
        "role": "Teaching Assistant",
        "period": "2024/25 Semester 1"
    },
    {
      "course": "NATURAL LANGUAGE PROCESSING (COMP5423_20232_A)",
      "role": "Teaching Assistant",
      "period": "2023/24 Semester 2"
    },
    {
      "course": "MOBILE COMPUTING (COMP4342_20231_A)",
      "role": "Teaching Assistant",
      "period": "2023/24 Semester 1"
    }
  ],
  "awards": [
    {
      "name": "Ranked <strong>4/750</strong> in 2021 Language and Intelligence Challenge (Baidu).",
      "year": "June 2021"
    },
    {
      "name": "The <strong>Third Prize</strong> Postgraduate Scholarship of Sun Yat-sen University.",
      "year": "2018-2019"
    },
    {
      "name": "Ranked <strong>4/119</strong> in Materials Quality Prediction Kaggle Competition",
      "year": "April-July 2018"
    },
    {
      "name": "The <strong>Second Prize</strong> Postgraduate Scholarship of Sun Yat-sen University.",
      "year": "2017-2018"
    },
    {
      "name": "<strong>Outstanding Graduates Awards</strong> of Sun Yat-sen University (Top 3% awarded)",
      "year": "June 2017"
    },
    {
      "name": "<strong>Excellent Graduation Thesis</strong> of Sun Yat-sen University (Top 3% awarded)",
      "year": "June 2017"
    },
    {
      "name": "The <strong>First Prize</strong> Scholarship of Sun Yat-sen University (Top 5% awarded)",
      "year": "2016-2017"
    },
    {
      "name": "The <strong>First Prize</strong> Scholarship of Sun Yat-sen University (Top 5% awarded)",
      "year": "2015-2016"
    },
    {
      "name": "The <strong>Third Prize</strong> Scholarship of Sun Yat-sen University",
      "year": "2014-2015"
    }
  ]
} 